{
    "entries": {
        "1938": [
            {
                "date": "July 5th 1938",
                "text": "Joined the Royal Navy at H.M.S. Caledonia,at Rosyth In Scotland as a boy 2nd class, myDaily pay was 9d, to-days equivalent is approximately 4p                DAD 3RD FROM LEFT FRONT ROW"
            }
        ],
        "1939": [
            {
                "date": "January 6th 1939",
                "text": "Transfer to H.M.S. St Vincent at Gosport Hampshire to complete my twelve months training"
            },
            {
                "date": "March 18th 1939",
                "text": "Rated boy 1st class that gave me a pay rise to 1 shilling and 3 pence to-day equivalent 7.5p"
            },
            {
                "date": "June 9th 1939",
                "text": "Completed my boys training and joined H.M.S. Ceres at Devonport, this was a cruiser used for boys training, this sea training ended abruptly on the 27th July as the threat of war increased."
            },
            {
                "date": "July 27th 1939",
                "text": "Joined H.M.S. Courageous an aircraft carrier at Devonport, at this time the Royal navy reserves were being called up and coming aboard to complete the ships company, shortly after this went to sea to carry on sea training off Ireland with the commencement of World War 2 in the not to distant future"
            },
            {
                "date": "September 3rd 1939",
                "text": "At 11 o'clock war was declared against Germany"
            },
            {
                "date": "September 17th 1939",
                "text": "Whilst on patrol off Ireland at 7.50pm H.M.S. Courageous was hit by two torpedoes fired from the German  U-boat U29, shortly afterwards she sank with a great loss of life, 519 were saved from the ships crew of approximately 1500. I was one of the lucky ones, after swimming for two hours was picked up by an American merchant ship the USS Collingwood, at this time the United States of America was not in the war but the crew of the Collinwood  looked after the survivors well, during the night we were transferred to H.M.S. Kelly whose captain was Louis Mountbatten, we were now on our way back to Devonport Royal Naval Barracks to be issued with new kit and hopefully to go on survivors leave."
            },
            {
                "date": "September 19th 1939",
                "text": "Arrived at Devonport and transferred to the R.N.barracks. We were able to send telegrams to our next of kin before proceeding on a fortnights survivors leave."
            },
            {
                "date": "October 3rd 1939",
                "text": "Returned to the R.N. Barracks from leave, shortly afterwards was transferred to a camp at Wembury which is about seven miles from Plymouth this had been a holiday camp just prior to the war starting, twenty of us were sent there all survivors from Courageous to prepare the place as an overflow camp for the R.N. barracks. After the Courageous was sunk there was controversy about young boys being sent to sea before they were seventeen, which was the age the other services had to be before going on active service, in the end boys under that age were not allowed to go to sea until they reached that age, unless they had their parents consent, hence my stay ashore for several months."
            }
        ],
        "1940": [
            {
                "date": "June 5th 1940",
                "text": "Joined H.M.S. Dorsetshire a county class cruiser at Devonport 1940 was mainly spent escorting convoys in the Atlantic and Indian Ocean with visits to ports in South Africa mainly Capetown, Durban and Simonstown. During our time in the Indian Ocean we carried out a bombardment at the port of \"Dante\" in Italian Somaliland, on the east coast of Africa a port, which was being used for the shipment of ore to Italy."
            }
        ],
        "1941": [
            {
                "date": "May 1941",
                "text": "Returning to England with a convoy from South Africa we were ordered to leave the convoy and head for the area were the German battleship was which was near the Bay of Biscay."
            },
            {
                "date": "May 27th 1941",
                "text": "Early morning sighted \"Bismarck\"When we came within range of \"Bismarck we opened fire with our 8\" guns and carried on firing until we were ordered to attack with our torpedoes, two were fired at the starboard side and one at the port side, all three hit and at 1040 I saw the Bismarck roll over and sink leaving the surface covered in debris and struggling German sailors. We managed to rescue about 40 of the German survivors, more could have been rescued but due to a report of a German U-Boat being in the vicinity our Captain B.C.S. Martin decided not to stay in the area, eventually arriving at Newcastle where the Germans were taken to a prisoner of war camp."
            },
            {
                "date": "May 28th 1941",
                "text": "Promoted to Ordinary Seaman. After having some leave we sailed from Newcastle to the South Atlantic are looking for German raiders which were sinking our valuable merchant ships bringing food supplies to the U.K."
            },
            {
                "date": "November 28th 1941",
                "text": "Promoted to Able Seaman, still at sea looking for enemy raiders"
            },
            {
                "date": "December 6th 1941",
                "text": "Our tedious weeks at sea are rewarded by the sighting of a German raider, the 10,000 ton raider was seen by our Walrus aircraft, after a short engagement with our 8\"guns the raider was sunk, no survivors were picked up due to U-Boats being in the area. Dorsetshire suffered no damage or casualties."
            }
        ],
        "1942": [
            {
                "date": "JanuaryFebruary March 1942",
                "text": "Operating in the Indian Ocean escorting convoys and with the Far East Fleet, during this time we visited Bombay, Durban, Columbo Trincomalee and Rangoon. At the end of March we had to return to Columbo to refuel."
            },
            {
                "date": "April 3rd 1942",
                "text": "Left Columbo to rejoin the fleet, in company with H.M.S. Cornwall."
            },
            {
                "date": "April 1942",
                "text": "After spending fourteen days survivors leave with some very nice people in Durban I joined the battleship H.M.S. Valiant which was in dry dock at Durban being repaired after being blown up a two man submarine in Alexander harbour, Egypt. On completion of the repairs left Durban for operations in the Indian Ocean occasionally returning to Mobassa to refuel and take on stores, during my time on Valiant I passed the examination for Leading seaman on the 27th September I was promoted to Leading Seaman."
            }, 
            {
                "date": "April 5th 1942 Easter Sunday",
                "text": "Dorsetshire and Cornwall attacked by 40 Japanese bomber aircraft at about 2.00pm both ships were so badly damaged we were told to abandon ship, shortly afterwards both ships sank with heavy loss of life, after being in the sea for 33 hours some of us were rescued by a Royal Navy destroyer H.M.S. Paladin, eventually I was transferred to the battleship H.M.S. Ramalies and taken to Mombassa in East Africa where I was sent to a troopship called the Mendosa for passage to Durban, South Africa where I had two weeks survivors leave before joining H.M.S. Valiant, it was quite a coincidence that I should take passage on the Mendosa as she had been captured by us after the fall of France in 1940, the ship being of French registration it was uncertain whether she would return to occupied France and by used by the Germans."
            }
        ],
        "1943": [
            {
                "date": "June 1943",
                "text": "Returned to England arriving at Plymouth for leave. On completion of leave sailed from Plymouth to an area north of Scotland to carry out bombardment practice in preparation for the invasion of Sicily and Italy (Salerno), on completion sailed for Malta. We stayed in Malta until required for the landings in Sicily, we were part of the force, which had to do the bombardment prior to the landings."
            },
            {
                "date": "July 1943",
                "text": "After the German and Italian forces had been driven out of Sicily a group of us from Valiant were allowed ashore to see the damage we had done with our bombardment this was at a place called Catania, our 15\" guns had certainly devastated the place."
            },
            {
                "date": "September 1943",
                "text": "At the beginning of the month the allied forces were meeting stiff resistance as they advanced North through Italy and our next assignment was to assist the land forces landing at Salerno, once again our 15\" guns were kept busy as this was particularly strong enemy area, on numerous occasions we were attacked by dive bombers and torpedo planes, fortunately we sustained no damage or casualties. Escorted Italian fleet into Malta."
            },
            {
                "date": "October 15th 1943",
                "text": "Returned to Plymouth were our ships company changed over with the ships company of H.M.S. Malaya, we then took Malaya to Gareloch in Scotland to be used as an accommodation ship and eventually to be scrapped."
            },
            {
                "date": "November 26th 1943",
                "text": "Arrived back at the Royal Naval Barracks Plymouth to do course on gunnery."
            }
        ],
        "1944": [
            {
                "date": "April 15th 1944",
                "text": "Joined the frigate H.M.S. Exe, our job was to escort convoys from Liverpool to St Johns in Newfoundland and return, and from Grenock in Scotland to Gibraltar."
            }
        ],
        "1945": [
            {
                "date": "May 8th 1945",
                "text": "Germany surrendered at this time we were half way across the Atlantic Ocean with a homeward bound convoy, on arrival at Liverpool with the other five ships of our escort group we were welcomed by ladies of the Women's Volunteer Service and dockyard workers also the dockyard Padre, they had laid out tables on the dockside with enormous amounts of food and beer, where it came from is a mystery because at that time these items were in short supply, needless to say we all had a good time, a very enjoyable victory celebration. Although the war in Europe was over our duty of escorting convoys wasn't, we did further trips across the Atlantic eventually taking. \"EXE\" into Dartmouth Devon to be laid up and put into reserve."
            },
            {
                "date": "July 19th 1945",
                "text": "Returned to the Royal Naval Barracks at Plymouth to await another ship."
            },
            {
                "date": "September 10th 1945",
                "text": "Joined H.M.S. Niger a minesweeper and proceeded to the far east again to start mine sweeping off the Malayian coast, our base being Penang, eventually we moved to the Borneo area to commence our minesweeping duty there."
            },
            {
                "date": "December 31st 1945",
                "text": "Passed the examination for Petty Officer"
            }
        ],
        "1946": [
            {
                "date": "January 1st 1946",
                "text": "Promoted to Petty Officer, during our time in the Borneo area I developed a tropical ulcer on my right ankle for several weeks I was confined to bed in the sick bay of \"Niger\" which didn't seem to be improving my ankle at all, eventually it was decided to transfer me to the Royal Naval Hospital at Singapore."
            },
            {
                "date": "September 19th 1946",
                "text": "After being in hospital for a further period and no improvement in my ankle it was decided to send me back to England, I had a very comfortable journey home on the liner \"Britannic\"."
            },
            {
                "date": "November 19th 1946",
                "text": "Docked at Southampton and taken to the Royal Naval Hospital at Gosport, after a short stay there I was transferred to the Naval Hospital at Sherborne in Dorset, after more treatment the ulcer did eventually heal."
            }
        ],
        "1947": [
            {
                "date": "June 24th 1947",
                "text": "Discharged from hospital and returned to the Royal Naval Barracks."
            },
            {
                "date": "August 14th 1947",
                "text": "Transferred   to H.M.S. Raleigh at Torpoint, Cornwall to take up duty as Petty Officer of the Guard, this entailed training junior ratings in parade drill commonly known as square bashing."
            }
        ],
        "1948": [
            {
                "date": "February 3rd 1948",
                "text": "Sent back to the R.N. Barracks to await a Petty Officers leadership course at H.M.S. Royal Arthur, a training school at Corsham near Bath.TOP PHOTO    DAD, TOP ROW SIXTH FROM LEFTBOTTOM PHOTO DAD,  MARKED BY ARROW"
            },
            {
                "date": "February 19th 1948",
                "text": "Petty Officers leadership course commenced"
            },
            {
                "date": "April 14th 1948",
                "text": "Petty Officers Leadership course completed and wasn't at all sorry it was a very hectic and high pressure course, certainly felt a lot fitter than when I started the course."
            },
            {
                "date": "April 15th 1948",
                "text": "Returned to the R.N.Barracks at Devonport."
            },
            {
                "date": "April 28th 1948",
                "text": "Sent to H.M.S. Harrier in South Wales to do a course on RADAR"
            },
            {
                "date": "July 10th 1948",
                "text": "Transferred to H.M.S. Dryad at Southwick near Fareham to do a further course on RADAR, to qualify as a RADAR operator second class."
            },
            {
                "date": "November 7th 1948",
                "text": "Returned to R.N. Barracks at Devonport."
            }
        ],
        "1949": [
            {
                "date": "March 14th 1949",
                "text": "Left England on the troopship Lancashire enroute for Hong Kong where I was to join H.M.S. Jamaica a 6\" gun cruiser."
            },
            {
                "date": "May 3rd 1949",
                "text": "Arrived at Hong Kong and joined the Jamaica, on arrival onboard was informed I would be carrying out the duty of boys instructor this is where I first met Petty Officer W.C.W. Davis he was also a boys instructor, it was during my time on Jamaica that the Korean war started, we were the first warship to enter the war zone, several months were spent in the area during which time we had a number of casualties due to North Korean aircraft attacks during the landing at \"INCHON\", also being hit by a shore battery shell whilst bombarding the East coast of Korea which killed nine personal, on another occasion when in company with the United States cruiser we were attacked by six North Korean torpedo boats, we suffered no damage or casualties but managed to sink all six boats one way or another, five were sunk by gun fire and the other one ended up on the beach damaged to such an extent that it was the safest thing to do for the crew."
            }
        ],
        "1951": [
            {
                "date": "June 15th 1951",
                "text": "Returned to England and to see Cynthia my first child for the first time at the age of 1year and 11months. After some well earned leave returned to H.M.S. Dryad and RADAR the school at Southwick to do another radar course."
            },
            {
                "date": "October 10th 1951",
                "text": "Moved to H.M.S. Dryad to commence my course."
            }
        ],
        "1952": [
            {
                "date": "April 4th 1952",
                "text": "Completed my course, which I passed and remained in Dryad for instructional duties."
            }
        ],
        "1953": [
            {
                "date": "July 16th 1953",
                "text": "Joined H.M.S. Warrior an aircraft carrier at Devonport, remaining there for several months preparing the ship for sea"
            }
        ],
        "1954": [
            {
                "date": "February 14th 1954",
                "text": "Left Devonport for Malta in the Mediterranean where we stayed for a couple of months."
            },
            {
                "date": "April 17th 1954",
                "text": "Left the Mediterranean for the Far East via the Suez Canal."
            },
            {
                "date": "April 26th 1954",
                "text": "Rendezvoused with the liner  \"Gothic\" on which was H.M. the Queen returning from her visit to Australia and New Zealand, after a ceremonial fly past by our aircraft a signal was received from Her Majesty to \"Splice the Main Brace\" a fitting end to the day. After leaving the Gothic we headed for Colombo in Ceylon (now Sri Lanka)."
            },
            {
                "date": "May 3rd 1954",
                "text": "Arrived at Colombo for a four-day visit."
            },
            {
                "date": "May 7th 1954",
                "text": "Left Colombo enroute for Singapore."
            },
            {
                "date": "May 12th 1954",
                "text": "Arrived at Singapore were we stayed for about three weeks, which was very enjoyable although the weather was very hot and humid."
            },
            {
                "date": "June 6th 1954",
                "text": "Left Singapore for Hong Kong."
            },
            {
                "date": "June 8th 1954",
                "text": "Arrived at Hong Kong for a short vist it."
            },
            {
                "date": "June 12th 1954",
                "text": "Left Hong Kong for Kobe in Japan"
            },
            {
                "date": "June 16th 1954",
                "text": "Arrived at Kobe but no shore leave was given as our visit was for our Captain to be briefed by our American counterpart so left Kobe the same evening for the night trip to Kure in Japan."
            },
            {
                "date": "June 17th 1954",
                "text": "Arrived at Kure for a short stay, this port was very popular I had been there on several occasions before when serving on H.M.S Jamaica."
            },
            {
                "date": "June 20th 1954",
                "text": "Sailed for Sasebo in Japan, at Sasebo we joined up with American and Canadian ships for various exercises at sea on a wartime basis."
            },
            {
                "date": "June 28th 1954",
                "text": "We parted company with our American and Canadian friends and anchored off Inchon in Korea, this brought back memories of not so long ago when I was on the Jamaica and the landings were taking place, this time it was much quieter, remaining with us off Inchon were our escort of two American destroyers the \"Philip and \"Renshaw\". On leaving Inchon I was transferred to the Philip for three days to have a look around their RADAR equipment, and a very enjoyable three days it was, the climax of the visit was when I was lifted from the Philip by helicopter quite an experience being swinging at the end of the wire and being dragged into the helicopter."
            },
            {
                "date": "July 4th 1954",
                "text": "Back at Kure, during our stay I visited \"Hiroshima\" where the first atomic bomb was drooped ten years before and had ended World War 2, there was still bomb damage to be seen after all that time."
            },
            {
                "date": "July 12th 1954",
                "text": "Sailed from Kure once again for various exercises that included a mock amphibious landing on \"Okinawa\" island by the American marines."
            },
            {
                "date": "July 24th 1954",
                "text": "Arrived back at Kure."
            },
            {
                "date": "July26th 1954",
                "text": "Sailed from Kure to return to the Korean area, during this period a torpedo was sighted and brought onboard to the surprise of all concerned it turned out to be of Russian origin, after examination it was handed over to the Americans."
            },
            {
                "date": "August 6th 1954",
                "text": "Arrived back at Kure for our final visit."
            },
            {
                "date": "August 8th 1954",
                "text": "Sailed for Singapore"
            },
            {
                "date": "August 16th 1954",
                "text": "Arrived at Singapore Naval base"
            },
            {
                "date": "August 25th 1954",
                "text": "We were informed that we might be required to assist in the evacuation of civilian refugees from \"Hiaphong\" in North Vietnam to \"Saigon in South Vietnam."
            },
            {
                "date": "August 28th 1954",
                "text": "Informed that we would be required to assist in the evacuation of the refugees, this entailed embarking extra medical staff, which included a Sister and two Nurses from the Royal Army Medical Corps, six Chinese cooks, two female Interpreters –cum-searchers and ten Asians for general duties."
            },
            {
                "date": "August 31st 1954",
                "text": "Left Singapore for Hiaphong"
            },
            {
                "date": "September 4th 1954",
                "text": "Arrived at Pucheron Island of Hiaphong, as we lay anchor the refugees were brought to us in French naval landing craft and it was a sorry sight to see, about 1,500 most of them women and children, as they came aboard they were fumigated and then accommodated in the aircraft hanger which had been completely cleared for this purpose, in all we did two trips and during this time had three babies born onboard, the refugees were taken to Cap St Jacques which is sixty miles from Saigon and transferred to American landing craft for the remainder of the journey to Saigon.The evacuation of refugees from Hiaphong to Saigon, Vietnam."
            },
            {
                "date": "One of three babies born onboard  September 1954",
                "text": "The three Storks one for each baby born onboard"
            },
            {
                "date": "September 15th 1954",
                "text": "Returned to Singapore naval Base."
            },
            {
                "date": "September 23rd 1954",
                "text": "Left Singapore For Hong Kong, during this trip we were told we would be leaving the Far East on the 16th October and returning to England via South Africa"
            },
            {
                "date": "October 16th 1954",
                "text": "Left Hong Kong for South Africa."
            },
            {
                "date": "November 1st 1954",
                "text": "Arrived at Durban South Africa, a place I have many happy memories of although my previous visits had been during World War 2. On leaving Durban we visited Port Elizabeth for a few days, after which we sailed for Dakar, Senegal on the west coast of Africa, it was into this port during World War 2 when I was serving on H.M.S. Dorsetshire that we escorted the French battleship \"Richelieu\" and eventually took part in the operation to immobilize her to prevent her from retuning to France and being used by the German, this operation obviously wasn't appreciated by the French as during our stay in the area we were bombed by the French Air Force, fortunately all the bombs missed us. Our next port of call was Gibraltar to do our duty free shopping before arriving home at Plymouth."
            }
        ],
        "1955": [
            {
                "date": "February 19th 1955",
                "text": "After having leave arrived at H.M.S. Dryad to do a RADAR course for instructional duties, on completing the course remained in Dryad for a few months on instructional duties."
            }
        ],
        "1956": [
            {
                "date": "October 20th 1956",
                "text": "Joined H.M.S Ark Royal at Devonport."
            },
            {
                "date": "November December 1956",
                "text": "These two months were taken up doing flying trails with new aircraft, returning to Plymouth for Xmas"
            }
        ],
        "1957": [
            {
                "date": "February 1957",
                "text": "A short visit to Gibraltar, during our stay there the Duke of Edinburgh visited us. On leaving Gibraltar we made our way north to the Moray Firth to prepare for the visit of H.M. the Queen who we met on her return from Demark in the Royal Yacht."
            },
            {
                "date": "March, April,And May 1957",
                "text": "After the visit of H.M. the Queen and the Duke of Edinburgh most of our time was spent around the British Isles doing flying training and taking part in exercises."
            },
            {
                "date": "May 1st 1957",
                "text": "Promoted to Chief Petty Officer."
            },
            {
                "date": "June 1957",
                "text": "Sailed to take part in the Jamestown, U.S.A. Centenary celebrations the U.S. Navy held a review at Norfolk, Virginia U.S.A. the British squadron being led by Ark Royal, on the way to Norfolk we found the replica of the \"Mayflower\" which had sailed from Plymouth several weeks before and was making her way to the U.S. Before leaving Norfolk a contingent of the ships company marched through the town to a great reception, I had the honour of being the Ensign bearer for the occasion. On leaving Norfolk we did flying training in the company with the U.S.S. Saratoga after which we had a four-day visit to the city of New YorkDAD"
            },
            {
                "date": "JulyAugust 1957",
                "text": "Most of this period was spent doing flying training."
            },
            {
                "date": "September 1957",
                "text": "Sailed for fleet exercise above the Artic Circle."
            },
            {
                "date": "October 1957",
                "text": "Sailed south for a visit to Lisbon in Portugal, on Trafalgar Day 21st October  Ark Royal was in the unusually fortunate position of being in the exact spot of the battle of Trafalgar at the exact hour or the day, a ceremony was held on the flight deck and the flag signal made famous by Nelson was hoisted at the mast."
            },
            {
                "date": "November 1957",
                "text": "This was a month of more exercises in the North Sea before returning to Devonport for Xmas leave."
            }
        ],
        "1958": [
            {
                "date": "January 1958",
                "text": "This was the start of our Mediterranean visit which lasted until June, during this period numerous foreign ports were visited namely Gibraltar, Genoa, Naples, Malta, Augusta and Palermo to name a few."
            },
            {
                "date": "July 1958",
                "text": "Returned to Plymouth."
            },
            {
                "date": "July 31st 1958",
                "text": "Left Ark Royal and returned to H.M.S. Dryad to take over the main administration office"
            }
        ],
        "1960": [
            {
                "date": "May 5th 1960",
                "text": "Left Dryad to join H.M.S. Camperdown  a destroyer that was at Devonport, it had been in dock for some considerable time being refitted."
            },
            {
                "date": "May 23rd 1960",
                "text": "Arrived at Portland in Dorset to commence seven weeks of intensive training, this entailed a lot of hard work for the whole ships company, doing gun firing trials, submarine exercises, sending landing parties ashore to help in an imaginary earthquake disaster all good practice for anything we may be required to do."
            },
            {
                "date": "July 1960",
                "text": "Arrived back at Plymouth for two days."
            },
            {
                "date": "July 9th 1960",
                "text": "Sailed for Londonderry in Ireland, for the next eighteen days we did anti-submarine exercises and being \"standby ship\" to go on the \"Cod war\" patrol, but we weren't required."
            },
            {
                "date": "July 28th 1960",
                "text": "Arrived back at Plymouth for eleven days leave and to give the ship a good clean."
            },
            {
                "date": "August 19th 1960",
                "text": "Sailed for Londonderry again to take part in a NATO exercise at the beginning of September."
            },
            {
                "date": "September 11th 1960",
                "text": "Visited Rosyth, Scotland with rest of the Home fleet."
            },
            {
                "date": "September 15th 1960",
                "text": "Sailed for NATO exercise in the North Sea."
            },
            {
                "date": "September 25th 1960",
                "text": "Crossed the Artic Circle so the ships company qualified for \"Blue Nose Certificates."
            },
            {
                "date": "October 2nd 1960",
                "text": "Returned to Plymouth safely after battling with a force 8 gale, our return to Plymouth was to give the ships company seven days leave and prepare to go to the Mediterranean."
            },
            {
                "date": "October 21st 1960",
                "text": "Sailed for the Mediterranean in company with H.M.S. Solebay and H.M.S. Saintes arriving in Gibraltar for a ten day stay and do the final preparations for our stay in the Med."
            },
            {
                "date": "November 4th 1960",
                "text": "Arrived at Malaga, Southern Spain for a five-day visit. After this we sailed for Toulon in the South of France, three days in Toulon and we were off to Malta."
            },
            {
                "date": "November 26th 1960",
                "text": "Arrived at Malta and stayed a week, then left for more exercises and a visit to Palermo in Sicily. The Xmas period was spent in Malta also the New Year, we eventually sailed for Gibraltar."
            }
        ],
        "1961": [
            {
                "date": "January 26th 1961",
                "text": "Arrived in Gibraltar to go into dock and stayed for five weeks, which was longer than anticipated due to certain defects, which were found by the dockyard staff. On leaving Gibraltar we paid a brief visit to Malta then on to Corfu for three days. From there we returned to Malta, for the next few months it was in and out of Malta during which time we did a lot of exercises with other ships of all nationalities."
            },
            {
                "date": "May 29th 1961",
                "text": "Our summer cruise commenced and the first stop was Barcelona Spain, here we stayed for five days before sailing for Marseille in the South of France where we stayed for a week."
            },
            {
                "date": "June 17th 1961",
                "text": "Joined the NATO fleet at Naples, Italy for the Commander-in-Chiefs review, returning to Malta three weeks later. After a short stay in Malta we were due to visit Salerno in Italy and a cruise in the Adriatic but this was cancelled because of trouble in Kuwait area in the Persian Gulf."
            },
            {
                "date": "July 3rd 1961",
                "text": "Sailed with the other units of the Med fleet to the Kuwait area, which took us through the Suez Canal and down the Red Sea, a visit to Aden was very welcome, and after spending seven weeks in the Persian Gulf we returned to Malta."
            },
            {
                "date": "September 4th 1961",
                "text": "Sailed from Malta to return to Plymouth, had a brief stop at Gibraltar on the way."
            },
            {
                "date": "September 14th 1961",
                "text": "Arrived at Plymouth after eleven months away from England."
            },
            {
                "date": "October 14th 1961",
                "text": "Sailed from Plymouth with the other ships in our squadron H.M.S. Solebay, Finisterre and Saintes for more exercises off the North and North East of Scotland."
            },
            {
                "date": "November 15th 1961",
                "text": "Arrived back at Plymouth for four days after which we were off to sea again for more exercises and visits to some home ports, sailed south through the Bay of Biscay to take up our position off the Canary Isles in the roll of Search and Rescue for the H.M. the Queens flight returning from a visit to West Africa."
            },
            {
                "date": "December 15th 1961",
                "text": "Returned to Plymouth to have a bit of leave for Xmas, on return from leave we left Plymouth to visit Le Havre, Bordeaux and Bilbao."
            }
        ],
        "1962": [
            {
                "date": "April 7th 1962",
                "text": "Returned to Plymouth."
            },
            {
                "date": "April 8th 1962",
                "text": "I left the Camperdown and returned to H.M.S. dryad where I was to remain until October 25th 1964 back in my old job in the main Admin Office."
            }
        ],
        "1964": [
            {
                "date": "October 26th 1964",
                "text": "Left H.M.S. Dryad to go to the NATO Headquarters H.M.S. Northwood, London to train Royal Naval Reserves in the underground war room, this was a very enjoyable and interesting job which lasted twelve months and on the 29th of November 1965 left to join H.M.S. Hermes."
            }
        ],
        "1965": [
            {
                "date": "November 30th 1965",
                "text": "Joined H.M.S. Hermes at Plymouth, this was to be my last ship of a thirty-year career in the Royal Navy, which ended on the 27th May 1968. During my two years on Hermes we visited many places abroad from the Mediterranean to the South Pacific, one of the most tedious periods was patrolling off Aden during the withdrawal of the British Forces from the area which entailed being at sea for 73 days, after this we visited Singapore for a rest which was very welcome, during my career in the R.N. I had never visited Australia but fortunately before leaving Hermes in January 1968 we went to Freemantle, west Australia.On returning to the Aden area I was transferred to a R.A.F. base from where I was brought home by plane. After having leave March April and May were spent in H.M.S. Dryad and the Royal Naval Barracks at Portsmouth from where I was discharged to civilian life. It was towards the end of my time in Hermes that I was informed I had been awarded the British Empire Medal"
            }
        ]
    }
}